## Pandas aula 4

In [2]:
# Apply, applymap, map

In [3]:
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [10, 20, 30, 40],
                   'C': [20, 40, 60, 80]
                   },
                  index=['Linha 1', 'Linha 2', 'Linha 3', 'Linha 4'])

In [5]:
df

         A   B   C
Linha 1  1  10  20
Linha 2  2  20  40
Linha 3  3  30  60
Linha 4  4  40  80

In [7]:
def custom_sum(row):
    return row.sum()

df['D'] = df.apply(custom_sum, axis=1)

In [8]:
df

         A   B   C    D
Linha 1  1  10  20   62
Linha 2  2  20  40  124
Linha 3  3  30  60  186
Linha 4  4  40  80  248

| Variable | Definition                                 | Key                                            |
|----------|--------------------------------------------|------------------------------------------------|
| survival | Survival                                   | 0 = No, 1 = Yes                                |
| pclass   | Ticket class                               | 1 = 1st, 2 = 2nd, 3 = 3rd                      |
| sex      | Sex                                        |                                                |
| Age      | Age in years                               |                                                |
| sibsp    | # of siblings / spouses aboard the Titanic |                                                |
| parch    | # of parents / children aboard the Titanic |                                                |
| ticket   | Ticket number                              |                                                |
| fare     | Passenger fare                             |                                                |
| cabin    | Cabin number                               |                                                |
| embarked | Port of Embarkation                        | C = Cherbourg, Q = Queenstown, S = Southampton |

**Variable Notes**  
pclass: A proxy for socio-economic status (SES)  
1st = Upper  
2nd = Middle  
3rd = Lower  

age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

sibsp: The dataset defines family relations in this way...  
Sibling = brother, sister, stepbrother, stepsister  
Spouse = husband, wife (mistresses and fianc√©s were ignored)  

parch: The dataset defines family relations in this way...  
Parent = mother, father  
Child = daughter, son, stepdaughter, stepson  
Some children travelled only with a nanny, therefore parch=0 for them